In [1]:
from google.cloud import bigquery

In [106]:
client = bigquery.Client()

In [67]:
client

In [68]:
import pandas as pd

In [69]:
titanic = pd.read_csv('../../ironhack-analytics/pca/titanic_processed.csv')

In [72]:
dataset = 'ironhack_database'

In [73]:
client.load_table_from_dataframe(titanic, f'{dataset}.titanic')

In [112]:
ds_list = client.list_tables(dataset)
pd.DataFrame(dict(table_name=[table.table_id for table in ds_list]))

  table_name
0    titanic

In [109]:
table_name=[table.table_id for table in client.list_tables(dataset)]

In [74]:
job_config = bigquery.QueryJobConfig()

In [76]:
job_config.dry_run = True

In [77]:
job_config.use_query_cache = False

In [94]:
sql = f'SELECT Survived FROM {dataset}.titanic'

In [95]:
job = client.query(sql, location='US', job_config=job_config)

In [93]:
mb = job.total_bytes_processed
mb

56960

In [96]:
mb = job.total_bytes_processed
mb

5696

In [83]:
dollar = (job.total_bytes_processed / 1024**3) * 0.02
dollar/0.02 * 1024 **3

1.0609626770019532e-06

In [88]:
dollar = (job.total_bytes_processed) * 0.02
dollar

1.0609626770019531e-07

In [ ]:



mb = job.total_bytes_processed / 1024**2

# 0.02 cents for each GB processed.
dollar = (job.total_bytes_processed / 1024**3) * 0.02

In [84]:
job.total_bytes_billed

0

Table(TableReference(DatasetReference('ironhack-267217', 'ironhack_database'), 'titanic'))

In [99]:
result = Out[97]

In [141]:
@safe_query
def get_table():
    result = client.get_table(dataset + '.titanic')
    return client.list_rows(result).to_dataframe()

In [ ]:
def safe_query(query_method):
    def wrapper():
        return query_method()
    return wrapper

In [159]:
def my_decorator(f):
    def wrapper():
        try:
            print('before')
            1/0
            return f()
        except:
            print('Exception handled')
            return f()
    return wrapper

In [160]:
@my_decorator
def my_func():
    return 'mY FUNction'

In [161]:
print(my_func())

before
Exception handled
mY FUNction

In [162]:
import logging
logging.basicConfig(level=logging.INFO)

In [164]:
def safe_query(query_method):
    def wrapper():
        try:
            return query_method()
        except:
            logging.info('No connection found. Trying to reconnect.')
            client = bigquery.Client()
            return query_method()
        
    return wrapper

In [ ]:
get_table()

In [166]:
@safe_query
def get_table():
    result = client.get_table(dataset + '.titanic')
    return client.list_rows(result).to_dataframe()

In [167]:
get_table()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,0,3,1,49.0,0,0,0.0000,0,0,1
1,0,3,1,36.0,0,0,0.0000,0,0,1
2,0,1,1,38.0,0,0,0.0000,0,0,1
3,0,1,1,39.0,0,0,0.0000,0,0,1
4,0,3,1,19.0,0,0,0.0000,0,0,1
...,...,...,...,...,...,...,...,...,...,...
707,1,3,1,29.0,0,0,7.8958,1,0,0
708,1,1,0,54.0,1,0,78.2667,1,0,0
709,1,1,0,52.0,1,0,78.2667,1,0,0
710,1,1,1,25.0,1,0,91.0792,1,0,0
711,1,1,0,19.0,1,0,91.0792,1,0,0

In [238]:
get_table()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,0,3,1,49.0,0,0,0.0000,0,0,1
1,0,3,1,36.0,0,0,0.0000,0,0,1
2,0,1,1,38.0,0,0,0.0000,0,0,1
3,0,1,1,39.0,0,0,0.0000,0,0,1
4,0,3,1,19.0,0,0,0.0000,0,0,1
...,...,...,...,...,...,...,...,...,...,...
707,1,3,1,29.0,0,0,7.8958,1,0,0
708,1,1,0,54.0,1,0,78.2667,1,0,0
709,1,1,0,52.0,1,0,78.2667,1,0,0
710,1,1,1,25.0,1,0,91.0792,1,0,0
711,1,1,0,19.0,1,0,91.0792,1,0,0